Repository: pigamux/pigamux.github.io
Catalog: games/edc/TheEvolutionOfTrust.tmx
Source language: en_us
Languages: pt_pt

source: The Evolution of Trust
pt_pt: A Evolução da Confiança

source: an interactive guide to the game theory of why & how we trust each other
pt_pt: um guia interativo para a teoria dos jogos do porquê e como confiamos uns nos outros

source: loading...
pt_pt: a carregar...

source: ON
pt_pt: LIGADO

source: OFF
pt_pt: DESLIGADO

source: <g id="1">THE</g><x id="2"/> EVOLUTION<x id="3"/> <g id="4">OF TRUST</g>
pt_pt: <g id="1">A</g><x id="2"/> EVOLUÇÃO<x id="3"/> <g id="4">DA CONFIANÇA</g>

source: playing time: 30 min • by nicky case, july 2017 <x id="1"/> <x id="2"/>
pt_pt: tempo de jogo: 30 min • criado por nicky case, julho de 2017 <x id="1"/> <x id="2"/>

source: PLAY →
pt_pt: JOGAR →

source: During World War I, peace broke out. <x id="1"/><x id="2"/>
pt_pt: Durante a Primeira Guerra Mundial, a paz eclodiu. <x id="1"/><x id="2"/>

source: It was Christmas 1914 on the Western Front.<x id="3"/>
pt_pt: Era o Natal de 1914 na Frente Ocidental.<x id="3"/>

source: Despite strict orders <g id="4">not</g> to chillax with the enemy, British<x id="5"/> and German soldiers left their trenches, crossed No Man's Land,<x id="6"/> and gathered to bury their dead, exchange gifts, and play games. <x id="7"/><x id="8"/>
pt_pt: Apesar de ordens claras para <g id="4">não</g> ficar à vontade com o inimigo, soldados<x id="5"/> ingleses e alemães deixaram as suas trincheiras, atravessaram a Terra de Ninguém,<x id="6"/> e reuniram-se para enterrar os seus mortos, trocar presentes e jogar uns jogos. <x id="7"/><x id="8"/>

source: Meanwhile: it's 2017, the West has been at peace for decades, and<x id="9"/> wow, we <g id="10">suck</g> at trust.
pt_pt: Entretanto: é 2017, o Ocidente está em paz há décadas, e<x id="9"/> uau, somos uns <g id="10">zeros à esquerda</g> no que toca a confiança.

source: Surveys show that, over the past forty years, fewer and fewer people say they trust each other.
pt_pt: Pesquisas mostram que, nos últimos quarenta anos, cada vez menos pessoas dizem que confiam umas nas outras.

source: So here's our puzzle: <x id="11"/><x id="12"/> <bx id="13"/>Why, even in peacetime, do friends become enemies?<x id="14"/>
pt_pt: Eis então o nosso enigma: <x id="11"/><x id="12"/> <bx id="13"/>Porque é que, mesmo em tempos de paz, amigos se tornam inimigos?<x id="14"/>

source: And why, even in wartime, do enemies become friends?<ex id="_13"/> <x id="15"/><x id="16"/>
pt_pt: E porque é que, mesmo em tempos de guerra, inimigos se tornam amigos?<ex id="_13"/> <x id="15"/><x id="16"/>

source: I think <g id="17">game theory</g> can help explain our epidemic of distrust –<x id="18"/> and how we can fix it!
pt_pt: Penso que a <g id="17">teoria dos jogos</g> consegue ajudar a explicar a nossa epidemia de desconfiança –<x id="18"/> e como a podemos consertar!

source: So, to understand all this...
pt_pt: Então, para compreender tudo isto...

source: ...let's play a game.
pt_pt: ...vamos jogar um jogo.

source: you<x id="1"/>cooperate
pt_pt: tu<x id="1"/>cooperas

source: you<x id="1"/>cheat
pt_pt: tu<x id="1"/>trais

source: they<x id="1"/>cooperate
pt_pt: ele<x id="1"/>coopera

source: they<x id="1"/>cheat
pt_pt: ele<x id="1"/>trai

source: you<x id="1"/>↙
pt_pt: tu<x id="1"/>↙

source: other player<x id="1"/>↘
pt_pt: o outro jogador<x id="1"/>↘

source: <g id="1">THE GAME OF TRUST</g> <x id="2"/> You have one choice.
pt_pt: <g id="1">O JOGO DA CONFIANÇA</g> <x id="2"/> Tens uma escolha a fazer.

source: In front of you is a machine: if you put a coin in the machine, the <g id="3">other player</g> gets three coins – and vice versa.
pt_pt: À tua frente está uma máquina: se inserires uma moeda na máquina, o <g id="3">outro jogador</g> recebe três moedas – e vice-versa.

source: You both can either choose to COOPERATE (put in coin), or CHEAT (don't put in coin).
pt_pt: Vocês os dois podem escolher ou COOPERAR (inserir moeda), ou TRAIR (não inserir moeda).

source: <g id="1">Let's say the other player cheats, and doesn't put in a coin.</g><x id="2"/>
pt_pt: <g id="1">Suponhamos que o outro jogador trai a tua confiança, e não insere nenhuma moeda.</g><x id="2"/>

source: What should you do?
pt_pt: O que é que tu deverias fazer?

source: Exactly!
pt_pt: Exatamente!

source: Why let that moocher mooch off of you?
pt_pt: Porquê deixar aquele traidor levar a melhor sobre ti?

source: Alas, turning the other cheek just gets you slapped!
pt_pt: Infelizmente, apresentar a outra face faz mesmo com que te batam!

source: If you cooperate & they cheat, you lose a coin while they gain three. (score: -1 vs +3) However, if you both cheat, neither of you gain or lose anything. (score: 0 vs 0) <g id="1">Therefore: you should CHEAT.</g>
pt_pt: Se tu cooperares e ele te trair, tu perdes uma moeda e ele ganha três. (pontuação: -1 vs +3) No entanto, se vocês os dois traírem a confiança do outro, nenhum de vocês ganha nada nem perde nada. (pontuação: 0 vs 0) <g id="1">Ou seja: deves TRAIR.</g>

source: <g id="1">But let's say the other player cooperates, and puts in a coin.</g><x id="2"/>
pt_pt: <g id="1">Mas suponhamos que o outro jogador coopera, e insere uma moeda.</g><x id="2"/>

source: What should you do now?
pt_pt: O que é que tu deverias fazer desta vez?

source: Wow, that's mean... and also the correct answer!
pt_pt: Uau, isso é bem mauzinho da tua parte... e também é a resposta certa!

source: Sure, seems like the right thing to do...
pt_pt: Claro, parece a coisa certa a se fazer...

source: <g id="1">OR IS IT??</g>
pt_pt: <g id="1">OU SERÁ QUE É??</g>

source: Because if you both cooperate, you both give up a coin to gain three. (score: +2 vs +2) But if you cheat & they cooperate, you gain three coins at their cost of one. (score: +3 vs -1) <g id="1">Therefore: you "should" still CHEAT.</g>
pt_pt: Porque se vocês os dois cooperarem, ambos abdicam de uma moeda para ganhar três. (pontuação: +2 vs +2) Mas se tu o traíres e ele cooperar contigo, tu ganhas três moedas pelo preço de uma. (pontuação: +3 vs -1) <g id="1">Ou seja: ainda "deves" TRAIR.</g>

source: And <g id="1">that's</g> our dilemma.
pt_pt: E é <g id="1">esse</g> o nosso dilema.

source: Trust is nice, but it can let others take advantage of you -- or shoot you as you come unarmed out of a trench.
pt_pt: Confiar é bom, mas pode fazer com que os outros se aproveitem de ti -- ou que disparem contra ti enquanto sais desarmado de uma trincheira.

source: Sometimes, distrust <g id="2">is</g> rational!
pt_pt: Às vezes, a desconfiança <g id="2">é</g> racional!

source: But now, what happens if we play this game...
pt_pt: Mas e agora, o que é que acontece se jogarmos este jogo...

source: ...more than once?
pt_pt: ...mais do que uma vez?

source: <g id="1">Now, let's play for real.</g>
pt_pt: <g id="1">Agora, vamos jogar a sério.</g>

source: You'll be playing against 5 different opponents, each with their own game "strategy".
pt_pt: Vais jogar contra 5 adversários diferentes, cada um com a sua própria "estratégia" de jogo.

source: With each opponent, you'll play anywhere between 3 to 7 rounds.
pt_pt: Contra cada adversário, vais jogar um certo número de rondas, que pode variar entre 3 e 7.

source: (You won't know in advance when the last round is) Can you trust them?
pt_pt: (Não vais saber com antecedência quando é a última ronda) Será que podes confiar neles?

source: Or rather... can they trust <g id="2">you?</g>
pt_pt: Ou melhor... será que eles podem confiar em <g id="2">ti?</g>

source: Pick your first, <g id="1">real</g> move.
pt_pt: Faz a tua primeira jogada <g id="1">a sério</g>.

source: <g id="2">Choose wisely.</g>
pt_pt: <g id="2">Pensa bem.</g>

source: opponent: [X] of [Y]
pt_pt: adversário: [X] de [Y]

source: your total score:
pt_pt: a tua pontuação total:

source: And your total score is...
pt_pt: E a tua pontuação total é...

source: which is, wow, actually <g id="1">impressively</g> bad.
pt_pt: que é, uau, <g id="1">incrivelmente</g> má, para dizer a verdade.

source: which, uh, could be worse!
pt_pt: que, uh, poderia ser pior!

source: which ain't bad!
pt_pt: que não é má!

source: which is pretty good!
pt_pt: que é bem boa!

source: which is <g id="1">perfect!</g>
pt_pt: que é <g id="1">perfeita!</g>

source: Congrats you have too much time on your hands.
pt_pt: Parabéns, tens demasiado tempo livre.

source: ...i have no idea how you did that.
pt_pt: ...eu não faço ideia de como conseguiste obter este resultado.

source: (the lowest & highest possible scores are 7 and 49, respectively)
pt_pt: (as pontuações mais baixa e mais alta possíveis são 7 e 49, respetivamente)

source: So who were these strange characters you just played against?
pt_pt: E então, quem eram estas personagens estranhas contra quem acabaste de jogar?

source: <g id="1">COPYCAT:</g> Hello!
pt_pt: <g id="1">COPIÃO:</g> Olá!

source: I start with Cooperate, and afterwards, I just copy whatever you did in the last round.
pt_pt: Eu começo com Cooperar, e posteriormente, apenas copio o que quer que tu tenhas jogado na última ronda.

source: Meow
pt_pt: Miau

source: <g id="1">ALWAYS CHEAT:</g> <g id="2">the strong shall eat the weak</g>
pt_pt: <g id="1">TRAIDOR:</g> <g id="2">o forte comerá o fraco</g>

source: <g id="1">ALWAYS COOPERATE:</g> Let's be best friends!
pt_pt: <g id="1">COOPERADOR:</g> 'Bora ser melhores amigos!

source: <g id="1">GRUDGER:</g> Listen, pardner.
pt_pt: <g id="1">RANCOROSO:</g> Olha aqui, parceiro.

source: I'll start cooperatin', and keep cooperatin', but if y'all ever cheat me, I'LL CHEAT YOU BACK 'TIL THE END OF TARNATION.
pt_pt: Eu começo a cooperar, e continuo a cooperar, mas se tu me traíres uma vez que seja, EU VOU-TE TRAIR ATÉ AO ÚLTIMO DOS TEUS DIAS.

source: <g id="1">DETECTIVE:</g> First: I analyze you.
pt_pt: <g id="1">DETETIVE:</g> Primeiro, eu analiso-o.

source: I start: Cooperate, Cheat, Cooperate, Cooperate.
pt_pt: Começo a Cooperar consigo, Traio-o, Coopero, Coopero.

source: If you cheat back, I'll act like <g id="2">Copycat</g>.
pt_pt: Se me trair de volta, passarei a agir como o <g id="2">Copião</g>.

source: If you never cheat back, I'll act like <g id="3">Always Cheat</g>, to exploit you.
pt_pt: Se nunca me trair de volta, passarei a agir como o <g id="3">Traidor</g>, para explorá-lo.

source: Elementary, my dear Watson.
pt_pt: Elementar, meu caro Watson.

source: Now, what if these characters were to play...
pt_pt: Muito bem, e se agora estas personagens jogassem...

source: ...against each other?
pt_pt: ...umas contra as outras?

source: It's tournament time!
pt_pt: É hora do torneio!

source: Each character will now play against every other character: that's 10 paired matches, and 10 rounds per match. <x id="1"/><x id="2"/>
pt_pt: Cada personagem vai agora jogar contra cada uma das outras personagens: o que perfaz 10 partidas de pares, e 10 rondas por partida. <x id="1"/><x id="2"/>

source: Who do you think will get the highest <g id="3">total</g> score?
pt_pt: Quem é que achas que terá a maior pontuação <g id="3">total</g>?

source: <g id="4">Think carefully about it... and then PLACE YOUR BETS:</g>
pt_pt: <g id="4">Pensa bem nisso... e depois FAZ A TUA APOSTA:</g>

source: Alright, you placed your bet on [CHAR]!
pt_pt: Muito bem, apostaste no [CHAR]!

source: Let's go through the matches one by one, and see how the tournament plays out...
pt_pt: Acompanhemos as partidas uma a uma, e vejamos como o torneio se desenrola...

source: first match →
pt_pt: primeira partida →

source: next match →
pt_pt: próxima partida →

source: <g id="1">Match #[N]:</g> [A] vs [B]
pt_pt: <g id="1">Partida n.º [N]:</g> [A] vs [B]

source: <g id="1">Rounds:</g>
pt_pt: <g id="1">Rondas:</g>

source: <g id="1">Total Scores:</g> [A] vs [B]
pt_pt: <g id="1">Pontuações Totais:</g> [A] vs [B]

source: Oh, by the way...
pt_pt: Oh, já agora...

source: You may be skeptical about that Christmas Truce story about the World War I trenches.
pt_pt: É possível que estejas cético quanto àquela história da Trégua de Natal sobre as trincheiras da Primeira Guerra Mundial.

source: Surely that was just a fluke?
pt_pt: De certeza que foi só um acaso... certo?

source: Yes, the truce was dramatic, but it was <g id="1">neither unique, nor unusual</g>.
pt_pt: Sim, a trégua foi dramática, mas não foi <g id="1">nem única, nem invulgar</g>.

source: Not <g id="1">every</g> trench joined in the peace, but it was pretty widespread.
pt_pt: Nem <g id="1">todas</g> as trincheiras aderiram à paz, mas até que ela foi bem difundida.

source: Many front-lines came up with the idea independently, and again: <g id="2">despite</g> specific, strict orders not to.
pt_pt: Várias linhas de frente tiveram essa mesma ideia independentemente, e repito: <g id="2">apesar</g> das ordens específicas e bem claras para não o fazer.

source: And in fact, even <g id="1">before</g> Christmas, several front-lines already <g id="2">had</g> established an unofficial, secret peace.
pt_pt: E de facto, mesmo <g id="1">antes</g> do Natal, várias linhas de frente já <g id="2">tinham</g> estabelecido uma paz secreta não-oficial.

source: They called it: <g id="1">the "live and let live" system.</g>
pt_pt: Chamaram-lhe: <g id="1">o sistema "vive e deixa viver".</g>

source: Basically, you don't shoot me, I don't shoot you.
pt_pt: Basicamente, tu não disparas contra mim, eu não disparo contra ti.

source: And this worked, in a lot of places!
pt_pt: E este sistema funcionou, em muitos lugares!

source: You may still be skeptical.
pt_pt: Pode ser que aindas estejas cético.

source: Most soldiers don't spontaneously form peace with the enemy.
pt_pt: A maioria dos soldados não forma paz espontaneamente com o inimigo.

source: What's so special about <g id="1">trench</g> warfare?
pt_pt: O que é que há de tão especial na guerra de <g id="1">trincheiras</g>?

source: Well, here's what's unique about the trenches: unlike almost every other form of war, you have to face the same <g id="1">specific soldiers</g> every day.
pt_pt: Bem, eis o que é único sobre as trincheiras: ao contrário de quase todas as outras formas de guerra, os soldados enfrentam os <g id="1">mesmos soldados</g> todos os dias.

source: <g id="1">It's a repeated game.</g>
pt_pt: <g id="1">É um jogo repetido.</g>

source: And that makes <g id="2">all</g> the difference.
pt_pt: E isso faz <g id="2">toda</g> a diferença.

source: Anyway.
pt_pt: Enfim.

source: And the winner is...
pt_pt: E o vencedor é...

source: (drumroll please...)
pt_pt: (rufem os tambores...)

source: <g id="1">COPYCAT!</g>
pt_pt: o <g id="1">COPIÃO!</g>

source: Congrats, you placed your bet on the right horse.
pt_pt: Parabéns, apostaste no cavalo certo.

source: (Apologies to your bet, [CHAR].)
pt_pt: (As minhas desculpas à tua aposta, o [CHAR].)

source: <g id="1">Copycat</g> goes by many names.
pt_pt: O <g id="1">Copião</g> tem muitos nomes.

source: The Golden Rule, reciprocal altruism, tit for tat, or... <g id="2">live and let live.</g>
pt_pt: A Regra de Ouro, altruísmo recíproco, olho por olho, ou... <g id="2">vive e deixa viver.</g>

source: That's why "peace" could emerge in the trenches of World War I: when you're forced to play the same game with the same <g id="3">specific people</g> (not just the same generic "enemy") over and over again -- <g id="4">Copycat</g> doesn't just win the battle, it wins the war. <x id="5"/><x id="6"/>
pt_pt: É por isso que a "paz" pôde emergir nas trincheiras da Primeira Guerra Mundial: quando se é obrigado a jogar o mesmo jogo com as <g id="3">mesmas pessoas</g> (não só o mesmo "inimigo" genérico) uma e outra vez -- O <g id="4">Copião</g> não ganha só a batalha, ele vence a guerra. <x id="5"/><x id="6"/>

source: But if things change a lot when you play multiple rounds of the same game, what if we play...
pt_pt: Mas se as coisas mudam bastante quando se joga várias rondas do mesmo jogo, que tal nós jogarmos...

source: ...multiple <g id="1">tournaments?</g>
pt_pt: ...vários <g id="1">torneios?</g>

source: Now, let's let our population of players <g id="1">evolve over time</g>.
pt_pt: Agora, deixemos a nossa população de jogadores <g id="1">evoluir com o passar do tempo</g>.

source: It's a 3-step dance:
pt_pt: É uma dança de 3 passos:

source: <g id="1">1. PLAY A TOURNAMENT</g><x id="2"/> Let them all play against each other, and tally up their scores.
pt_pt: <g id="1">1. ABRE UM TORNEIO</g><x id="2"/> Fá-los jogarem uns contra os outros, e soma os pontos.

source: <g id="1">2. ELIMINATE LOSERS</g><x id="2"/> Get rid of the 5 worst players. (if there's a tie, pick randomly between them)
pt_pt: <g id="1">2. ELIMINA OS PERDEDORES</g><x id="2"/> Livra-te dos 5 piores jogadores. (se houver um empate, escolhe aleatoriamente entre eles)

source: <g id="1">3. REPRODUCE WINNERS</g><x id="2"/> Clone the 5 best players. (if there's a tie, pick randomly between them)
pt_pt: <g id="1">3. REPRODUZ OS VENCEDORES</g><x id="2"/> Clona os 5 melhores jogadores. (se houver um empate, escolhe aleatoriamente entre eles)

source: ...and REPEAT, for as long as you'd like.
pt_pt: ...e REPETE, pelo tempo que quiseres.

source: Note: you don't have to wait for people to literally die & reproduce for culture to evolve -- all that's needed is that "unsuccessful" behaviors go away, and "successful" behaviors are imitated.
pt_pt: Nota: não é preciso esperar que as pessoas literalmente morram e se reproduzam para que a cultura evolua -- a única coisa que é necessária é que os comportamentos "malsucedidos" vão embora, e que os comportamentos "bem-sucedidos" sejam imitados.

source: So now...
pt_pt: Então agora...

source: ...let's see this in action.
pt_pt: ...'bora ver tudo isto em ação.

source: Say we start with the following population of players: <g id="1">15 Always Cooperates</g>, <g id="2">5 Always Cheats</g>, and <g id="3">5 Copycats</g>.
pt_pt: Suponhamos que começamos com a seguinte população de jogadores: <g id="1">15 Cooperadores</g>, <g id="2">5 Traidores</g>, e <g id="3">5 Copiões</g>.

source: (We'll ignore <g id="4">Grudger</g> & <g id="5">Detective</g> for now) <x id="6"/><x id="7"/> We're going to do the tournament-eliminate-reproduce dance a dozen times or so.
pt_pt: (Vamos ignorar o <g id="4">Rancoroso</g> e o <g id="5">Detetive</g> por agora) <x id="6"/><x id="7"/> Vamos fazer a dança do torneio-eliminação-reprodução uma dúzia de vezes ou mais.

source: Let's make another bet!
pt_pt: Vamos fazer outra aposta!

source: Who do you think will win the <g id="8">first</g> tournament?
pt_pt: Quem é que achas que vai ganhar o <g id="8">primeiro</g> torneio?

source: <g id="9">PLACE YOUR BETS, AGAIN:</g>
pt_pt: <g id="9">FAZ A TUA APOSTA, NOVAMENTE:</g>

source: Makes sense, <g id="1">Always Cooperate</g> outnumbers everyone else right now...
pt_pt: Faz sentido, o <g id="1">Cooperador</g> supera todos os outros em número neste momento...

source: Makes sense, <g id="1">Always Cheat</g> has a lot of <g id="2">Always Cooperates</g> to exploit...
pt_pt: Faz sentido, o <g id="1">Traidor</g> tem muitos <g id="2">Cooperadores</g> para explorar...

source: Makes sense, <g id="1">Copycat</g> won the tournament last time, why not again?...
pt_pt: Faz sentido, o <g id="1">Copião</g> ganhou o torneio da última vez, porque não outra vez?...

source: Let's see if you're correct:
pt_pt: Vamos ver se acertaste:

source: 1) play tournament
pt_pt: 1) abrir torneio

source: 2) eliminate bottom 5
pt_pt: 2) eliminar os 5 piores

source: 3) reproduce top 5
pt_pt: 3) reproduzir os 5 melhores

source: Alas, <g id="1">Always Cooperate</g> got eaten up by <g id="2">Always Cheat</g>, whose numbers have now increased by 5.
pt_pt: Infelizmente, os <g id="1">Cooperadores</g> foram devorados pelos <g id="2">Traidores</g>, que aumentaram agora a sua população em 5.

source: Sadly, you were correct!
pt_pt: Infelizmente, estavas certo!

source: The <g id="1">Always Cheaters</g> won this time, and their numbers increased by 5.
pt_pt: Os <g id="1">Traidores</g> ganharam desta vez, e a sua população aumentou em 5.

source: Alas, <g id="1">Copycat</g> did not win – but at least they didn't do as bad as <g id="2">Always Cooperate</g>.
pt_pt: Infelizmente, os <g id="1">Copiões</g> não ganharam – mas pelo menos não se saíram tão mal quanto os <g id="2">Cooperadores</g>.

source: They got eaten up by <g id="3">Always Cheat</g>, whose numbers have now increased by 5.
pt_pt: Eles foram devorados pelos <g id="3">Traidores</g>, que aumentaram agora a sua população em 5.

source: But let's try a few more rounds of this...
pt_pt: Mas tentemos mais umas rondas disto...

source: <g id="1">Always Cheat</g> is still growing, at the expense of <g id="2">Always Cooperate</g>...
pt_pt: Os <g id="1">Traidores</g> ainda se estão a reproduzir, às custas dos <g id="2">Cooperadores</g>...

source: And now, all the <g id="1">Always Cooperates</g> are dead.
pt_pt: E agora, todos os <g id="1">Cooperadores</g> estão mortos.

source: But, wait...
pt_pt: Mas, espera lá...

source: That's right: the <g id="1">Always Cheats</g> became a victim of their own success!
pt_pt: Assim é que é: os <g id="1">Traidores</g> tornaram-se vítimas do seu próprio sucesso!

source: They exploited the naive <g id="2">Always Cooperators</g>, but once they ran out of them, they had to face the <g id="3">Copycats</g>: who <g id="4">are</g> nice, but not naive.
pt_pt: Eles exploraram os ingénuos <g id="2">Cooperadores</g>, mas assim que acabaram com o stock deles, tiveram de enfrentar os <g id="3">Copiões</g>: que <g id="4">são</g> simpáticos, mas não são ingénuos.

source: By simply copying the other player's moves, <g id="1">Copycats</g> can play nice with each other, while <g id="2">Always Cheats</g> just cheat themselves!
pt_pt: Simplesmente copiando as jogadas do outro jogador, os <g id="1">Copiões</g> conseguem jogar bem uns com os outros, enquanto que os <g id="2">Traidores</g> se traem a si mesmos!

source: Not only that, but it also means <g id="3">Copycat</g> can give <g id="4">Always Cheat</g> a taste of their own medicine.
pt_pt: Para além disso, tal também significa que os <g id="3">Copiões</g> conseguem dar aos <g id="4">Traidores</g> um gostinho do próprio veneno.

source: And so, as a result...
pt_pt: E então, consequentemente...

source: <g id="1">Copycat</g> inherits the earth.
pt_pt: Os <g id="1">Copiões</g> herdam a terra.

source: So, although your bet was off -- the nice-but-naive <g id="1">Always Cooperators</g> were doomed from the start -- in the end, a <g id="2">smart</g> form of niceness prevailed, and the <g id="3">Always Cheaters</g> were squashed.
pt_pt: Então, apesar de a tua aposta estar errada -- os simpáticos, mas ingénuos, <g id="1">Cooperadores</g> estavam condenados desde o início -- no final, uma forma <g id="2">inteligente</g> de simpatia prevaleceu, e os <g id="3">Traidores</g> foram esmagados.

source: So, in the short run you were right - <g id="1">Always Cheat</g> won the first few rounds, but in the end, its exploitativeness was its downfall.
pt_pt: Então, a curto prazo estavas certo - os <g id="1">Traidores</g> ganharam as primeiríssimas rondas, mas no final, a sua exploração levou-os à ruína.

source: So, in the long run, you were right - <g id="1">Copycat</g> wins!
pt_pt: Então, a longo prazo, estavas certo - os <g id="1">Copiões</g> ganham!

source: <g id="2">Always Cheat</g> may have won in the short run, but its exploitativeness was its downfall.
pt_pt: Os <g id="2">Traidores</g> podem ter ganhado a curto prazo, mas a sua exploração levou-os à ruína.

source: This reminds me of a quote: <x id="1"/><x id="2"/> <g id="3">"We are punished by our sins, not for them."</g><x id="4"/>
pt_pt: Isto faz-me lembrar de uma frase: <x id="1"/><x id="2"/> <g id="3">"Somos punidos pelos nossos pecados, e não para eles."</g><x id="4"/>

source: (oh, and by the way...)
pt_pt: (oh, e já agora...)
